wisteria-1c/Конфигурация/Catalogs/МаршрутыСогласованияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>МаршрутыСогласованияЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчастникиМаршрута</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/МаршрутыСогласованияЗаявок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Предопределенный Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("УчастникиМаршрута"));
	КонецЕсли;
	
	Ошибки = Неопределено;
	
	УчастникиВременно = УчастникиМаршрута.Выгрузить();
    УчастникиВременно.Колонки.Добавить("Дубли");
    УчастникиВременно.ЗаполнитьЗначения(1, "Дубли");
    УчастникиВременно.Свернуть("Пользователь", "Дубли");
    Если УчастникиВременно.Количество() < УчастникиМаршрута.Количество() Тогда
        Для Каждого СтрокаУчастникиВременно из УчастникиВременно Цикл
            Если СтрокаУчастникиВременно.Дубли > 1 Тогда
        		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Пользователь ""%1"" задублирован в маршруте'"), СтрокаУчастникиВременно.Пользователь);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.УчастникиМаршрута", ТекстОшибки);
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
    
    ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления И Справочники.МаршрутыСогласованияЗаявок.МаршрутИспользуется(Ссылка) Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru = 'Нельзя пометить маршрут на удаление, так как он используется в несогласованных заявках!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
